{"[UNK]": 1, "begining": 9999, "brat": 9995, "brekkie": 9994, "charmed": 9993, "chars": 9992, "chased": 9991, "checkout": 9990, "cheryl": 9988, "cod4": 9985, "cranberry": 9983, "crazytwism": 9982, "denial": 9979, "drivein": 9978, "haunted": 9970, "hideous": 9969, "housing": 9966, "imm": 9965, "ina": 9964, "interwebs": 9963, "inventory": 9962, "jtv": 9961, "justine": 9959, "l4d": 9956, "legendary": 9954, "litter": 9953, "meatballs": 9951, "ox": 9946, "painfully": 9944, "paws": 9943, "photograph": 9942, "quotgt": 9940, "raped": 9937, "reserved": 9936, "retirement": 9934, "sharks": 9929, "skiing": 9927, "stylist": 9924, "sunlight": 9922, "sword": 9920, "tense": 9917, "tnt": 9916, "toaster": 9915, "tonsils": 9914, "trashed": 9913, "wednesdays": 9910, "ws": 9909, "yanks": 9908, "yepp": 9905, "zones": 9904, "2g": 9901, "3hotwords": 9900, "aged": 9895, "alcoholic": 9892, "andre": 9891, "antm": 9890, "askin": 9889, "broccoli": 9883, "browsers": 9882, "charms": 9879, "convenient": 9875, "copied": 9873, "cursed": 9870, "documents": 9865, "fade": 9860, "flavour": 9859, "googling": 9855, "hmv": 9852, "idols": 9851, "ignorance": 9850, "javascript": 9846, "lls": 9842, "marked": 9839, "mit": 9835, "nuttychris": 9832, "ouchies": 9830, "pac": 9828, "pleaseeee": 9825, "primeval": 9822, "quotthats": 9821, "religious": 9820, "robs": 9817, "selected": 9812, "sethsimonds": 9811, "sixth": 9809, "soldier": 9808, "sooooooooooo": 9807, "stamp": 9805, "stove": 9804, "tales": 9801, "tehe": 9799, "thatquot": 9798, "w8": 9790, "waaa": 9789, "1000th": 9786, "4get": 9785, "activated": 9783, "advise": 9782, "teemwilliams": 9919, "af": 9781, "allnighter": 9780, "announcements": 9779, "arthur": 9778, "chennai": 9989, "boil": 9777, "bully": 9775, "carried": 9773, "esmeeworld": 9862, "consolation": 9770, "cram": 9769, "donation": 9766, "engineering": 9765, "exhibit": 9761, "expense": 9760, "females": 9759, "frequently": 9758, "gcses": 9755, "httptrimlvbu": 9749, "ie6": 9748, "inspection": 9746, "mein": 9742, "misstattoo": 9740, "owen": 9738, "pakistan": 9736, "pf": 9734, "photobucket": 9733, "phx": 9732, "pickup": 9731, "jumps": 9960, "prospect": 9730, "recommending": 9729, "responsibility": 9728, "sippin": 9725, "sneaking": 9724, "staples": 9722, "webcast": 9715, "wolves": 9713, "wooot": 9712, "wt": 9711, "1hr": 9708, "aircon": 9707, "alittle": 9706, "amazinggg": 9705, "anh": 9704, "appealing": 9701, "awwwh": 9700, "bitchy": 9699, "canyon": 9697, "catholic": 9696, "challenging": 9695, "congratz": 9692, "destroying": 9691, "dq": 9690, "earliest": 9688, "evolution": 9687, "frogs": 9686, "gfs": 9685, "gs": 9683, "handling": 9682, "hugging": 9680, "iss": 9677, "jaylastarr": 9675, "kiddin": 9673, "knocking": 9672, "laguna": 9671, "licence": 9670, "literature": 9669, "mcrmuffin": 9668, "measure": 9667, "merlin": 9666, "mussomitchel": 9662, "parliament": 9659, "patty": 9658, "breakup": 9698, "psycho": 9651, "rider": 9649, "rochester": 9648, "sed": 9645, "sting": 9641, "stl": 9640, "stubborn": 9638, "studyin": 9637, "suffered": 9636, "taping": 9635, "thenewbnb": 9633, "thi": 9632, "vickytcobra": 9630, "watchn": 9629, "zoom": 9627, "31st": 9626, "achieve": 9625, "alexs": 9622, "brake": 9619, "capture": 9618, "chorus": 9615, "chriscornell": 9614, "definetly": 9611, "disappearing": 9610, "distractions": 9609, "elevator": 9605, "emotion": 9604, "genuine": 9601, "gummy": 9598, "hartluck": 9597, "heartbeat": 9596, "kite": 9593, "leslie": 9591, "loveyou": 9589, "manly": 9588, "modeling": 9583, "mosquitoes": 9582, "oooooo": 9578, "sew": 9930, "spaces": 9565, "spammer": 9564, "stir": 9563, "thot": 9558, "ughi": 9554, "wooohooo": 9550, "yoghurt": 9548, "kelsey": 9845, "830am": 9546, "drooling": 9689, "absence": 9543, "appointments": 9539, "atcha": 9538, "awesomely": 9536, "bd": 9534, "bri": 9533, "charlieskies": 9530, "coma": 9529, "commit": 9528, "crispy": 9527, "cyber": 9525, "daft": 9524, "damp": 9523, "devo": 9521, "difficulties": 9519, "exercising": 9514, "fkn": 9512, "florence": 9511, "gamer": 9509, "hellooo": 9500, "hiphop": 9499, "individual": 9498, "insult": 9497, "int": 9496, "jg": 9494, "landscape": 9493, "lindsey": 9491, "locations": 9490, "clan": 9771, "marvelous": 9489, "miranda": 9487, "nyquil": 9484, "prettier": 9479, "priorities": 9478, "redwings": 9476, "represent": 9475, "retweeted": 9474, "schedules": 9471, "soothing": 9469, "souls": 9468, "spec": 9467, "spoiler": 9466, "starship": 9465, "swallowed": 9463, "tanks": 9461, "verge": 9459, "whitney": 9458, "winding": 9456, "workk": 9454, "330am": 9453, "accidents": 9451, "choked": 9444, "contain": 9442, "crank": 9441, "dah": 9440, "detox": 9435, "doe": 9432, "eleven": 9430, "fifteen": 9427, "goofy": 9426, "harley": 9425, "hiatus": 9424, "installation": 9421, "labs": 9417, "lib": 9416, "mcr": 9414, "officialcharice": 9409, "orchidflower": 9408, "pala": 9407, "plates": 9405, "sauna": 9398, "shaped": 9396, "slumber": 9394, "snuggled": 9393, "traceyhewins": 9386, "waaah": 9384, "60s": 9382, "yourselves": 9547, "aired": 9378, "anberlin": 9376, "anythin": 9375, "appeared": 9374, "awwwwwww": 9373, "barbara": 9371, "bunches": 9368, "chewed": 9364, "chewing": 9363, "convos": 9360, "corey": 9359, "cruz": 9356, "deb": 9354, "diploma": 9353, "disapointed": 9352, "djs": 9350, "expenses": 9349, "firm": 9348, "hawkcam": 9345, "heavens": 9344, "hoes": 9343, "iamspectacular": 9342, "illinois": 9341, "landlord": 9337, "lined": 9335, "loool": 9334, "notification": 9328, "pulls": 9323, "refusing": 9322, "rope": 9319, "saints": 9317, "shanghai": 9313, "thier": 9302, "tia": 9301, "tlk": 9300, "ummmm": 9295, "underground": 9294, "understandable": 9293, "wher": 9291, "writes": 9288, "yoo": 9287, "\ufffd25": 9286, "77": 9285, "addthis": 9284, "brace": 9278, "capable": 9275, "carey": 9274, "collecting": 9271, "comm": 9270, "dancin": 9265, "decade": 9264, "donkey": 9261, "dual": 9260, "eddieizzard": 9258, "gladly": 9254, "hampm": 9252, "misha": 9585, "dug": 9259, "justify": 9249, "linkedin": 9244, "morgen": 9241, "privacy": 9237, "puppet": 9235, "reschedule": 9234, "sch": 9231, "scraped": 9230, "snuggling": 9225, "sophia": 9224, "warcraft": 9214, "yesh": 9209, "zen": 9208, "airline": 9205, "aussies": 9204, "blockbuster": 9203, "blond": 9202, "caitlin": 9201, "catherine": 9199, "chipped": 9198, "comparison": 9196, "consuming": 9195, "crave": 9194, "cudnt": 9193, "cv": 9192, "devils": 9189, "duke": 9185, "easiest": 9184, "element": 9182, "embrace": 9181, "fuse": 9177, "gearing": 9175, "graham": 9172, "chuckle": 9362, "headline": 9170, "hu": 9169, "kuya": 9162, "larger": 9161, "lata": 9160, "lease": 9159, "lp": 9157, "mattress": 9155, "obv": 9148, "ought": 9145, "patrol": 9143, "pools": 9139, "riskybusinessmb": 9134, "stupidly": 9130, "su": 9129, "sweeet": 9127, "thr": 9126, "ting": 9125, "flop": 9256, "toasted": 9124, "importantly": 9747, "tot": 9123, "tr": 9122, "tracy": 9121, "tres": 9119, "uncool": 9117, "unemployment": 9116, "66": 9111, "aaa": 9109, "arkansas": 9107, "austria": 9106, "backpack": 9105, "badd": 9104, "bebe": 9103, "bloated": 9102, "bonjour": 9101, "buenos": 9099, "capacity": 9098, "chronicles": 9096, "chuffed": 9095, "donna": 9092, "forces": 9089, "indians": 9081, "jasonmanford": 9079, "jennifalconer": 9078, "jensen": 9077, "logan": 9075, "meim": 9071, "mushroom": 9069, "obnoxious": 9067, "patterns": 9066, "prop": 9061, "ra": 9059, "reduce": 9057, "djalfy": 9866, "vagina": 9792, "reported": 9055, "smiled": 9054, "smoothly": 9053, "stinkin": 9052, "swings": 9050, "1100": 9902, "tow": 9049, "twiggas": 9046, "wig": 9043, "02": 9041, "airlines": 9040, "ankles": 9038, "apa": 9037, "arcade": 9036, "bandwidth": 9035, "biggie": 9033, "coachella": 9027, "cologne": 9025, "continued": 9024, "cupboard": 9022, "deli": 9020, "delta": 9019, "divorced": 9018, "eagle": 9016, "foggy": 9015, "g2g": 9014, "glitter": 9012, "hairy": 9010, "httptwitpiccom6q1om": 9009, "inform": 9007, "itbut": 9006, "kindness": 9003, "lalala": 9002, "lawyer": 9000, "lifted": 8999, "lobosworth": 8998, "lounging": 8997, "mere": 8994, "monsoon": 8992, "mosquitos": 8991, "mower": 8989, "pondering": 8979, "poolside": 8978, "piggy": 9065, "shiz": 8972, "singers": 8971, "soooon": 8969, "startup": 8968, "steady": 8967, "crutches": 9871, "syncing": 8965, "timberlake": 8963, "unlocked": 8959, "verse": 8958, "vlog": 8957, "wahoo": 8956, "weirdest": 8954, "scrap": 9470, "whoot": 8953, "win7": 8952, "\u00e9": 8951, "allllll": 8950, "bb10": 8949, "waist": 9788, "buried": 8944, "calvin": 8943, "candle": 8942, "chrisdaughtry": 8941, "clone": 8939, "confession": 8936, "drool": 8934, "duvet": 8933, "eg": 8932, "errr": 8931, "faded": 8930, "flirting": 8928, "fold": 8926, "fs": 8923, "haley": 8919, "impact": 8917, "ip": 8913, "jealousy": 8912, "woow": 9549, "lagi": 8909, "minnesota": 8906, "preferably": 8904, "pug": 8903, "roommates": 8900, "saddens": 8899, "stepping": 8892, "tees": 8890, "traditional": 8888, "trends": 8887, "tsarnick": 8886, "twitterbugs": 8885, "tyson": 8884, "unlikely": 8883, "wb": 8880, "willy": 8879, "xxxxxxx": 8878, "yeahhhh": 8876, "57": 8875, "93": 8873, "carter": 8868, "cells": 8867, "chess": 8866, "command": 8864, "concrete": 8862, "babysitter": 9372, "cvs": 8861, "defeat": 8859, "dice": 8858, "drenched": 8857, "duno": 8856, "ella": 8855, "elliot": 8854, "featuring": 8853, "foster": 8852, "homeee": 8846, "huggles": 8844, "iquotm": 8841, "izzy": 8840, "maui": 8838, "lalavazquez": 9745, "mcraddictal": 8837, "priority": 8828, "ps2": 8827, "rates": 8825, "relatively": 8824, "rin": 8822, "singles": 8818, "stacey": 8815, "swelling": 8813, "tale": 8812, "twitterrific": 8809, "whit": 8805, "yipee": 8803, "\u043d\u0430": 8802, "accurate": 8796, "allowing": 8794, "anoop": 8793, "auch": 8791, "becuase": 8789, "blackout": 8788, "borrowed": 8785, "britt": 8784, "brushing": 8783, "cj": 8781, "clumsy": 8780, "curls": 8775, "exploded": 8772, "flylady": 8771, "jams": 8766, "jasmine": 8765, "kart": 8764, "louise": 8762, "matthews": 8761, "mount": 8756, "munching": 8754, "neda": 8751, "permit": 8748, "pregnancy": 8746, "reverse": 8743, "shyt": 8741, "sketch": 8740, "specs": 8739, "takers": 8737, "theaters": 8734, "todaybut": 8733, "totaly": 8732, "txting": 8731, "creatures": 9358, "3oh3": 8726, "activation": 8724, "bumper": 8721, "buys": 8720, "caleb": 8719, "classics": 8716, "commenting": 8714, "console": 8713, "creme": 8712, "daytime": 8709, "diabetes": 8707, "dinners": 8706, "drown": 8703, "dumbass": 8702, "emailunlimited": 8701, "fork": 8698, "dakota": 8935, "fresno": 8697, "height": 9501, "frisbee": 8696, "hospitals": 8690, "panties": 9406, "indoor": 8687, "marina": 8684, "munchies": 8681, "mutual": 8680, "predict": 9481, "performances": 8677, "polar": 8676, "quotdo": 8674, "randy": 8673, "shin": 8670, "situations": 8668, "speechless": 8667, "stella": 8665, "tf2": 8662, "tomorro": 8661, "val": 8660, "49": 8657, "adjust": 8656, "anticipation": 8654, "camden": 8651, "cart": 8650, "craziness": 8648, "deniserichards": 8647, "diy": 8645, "fading": 8644, "ferrari": 8641, "flowing": 8638, "nicky": 8835, "groove": 8634, "grrrrrr": 8633, "haven": 8632, "hugged": 8629, "jc": 8628, "mishacollins": 9242, "lifequot": 8626, "lololol": 8625, "loyal": 8624, "mails": 8623, "majornelson": 8622, "utd": 9793, "mcds": 8618, "nih": 8616, "oracle": 8615, "outstanding": 8614, "pipe": 8612, "pixie": 8611, "cheerios": 9366, "pms": 8610, "pointed": 8609, "pout": 8608, "previews": 8607, "foo": 9510, "racist": 8605, "rainbows": 8604, "refund": 8602, "releasing": 8601, "savings": 8599, "shaheen": 8598, "snakes": 8596, "boats": 9448, "stroll": 8595, "sucha": 8594, "therealshaq": 8593, "tango": 9559, "twiiter": 8592, "partners": 8981, "yeap": 8589, "asylm": 8585, "bakery": 8584, "beijing": 8583, "bluray": 8581, "champs": 8578, "delighted": 8576, "electronic": 8575, "excel": 8574, "expression": 8573, "favour": 8572, "gina": 8569, "gown": 8566, "haaa": 8564, "ipods": 8563, "jquery": 8558, "limo": 8556, "fuckers": 8922, "makeover": 8554, "neon": 8551, "networks": 8550, "oki": 8547, "soar": 9310, "oliviamunn": 8546, "ouchie": 8545, "scrambled": 8539, "soulja": 8536, "tak": 8533, "hysterical": 9008, "temptation": 8530, "vm": 9385, "topshop": 8529, "touches": 8528, "waz": 8527, "chesterday": 9365, "weigh": 8526, "ryans": 9646, "yee": 8523, "82": 8521, "affect": 8520, "albert": 8518, "anthem": 8517, "blogged": 8513, "champ": 8512, "choco": 8510, "aids": 8519, "crystalchappell": 8507, "cue": 8506, "dontyouhate": 8504, "darkness": 9439, "downhill": 8503, "emotionally": 8502, "onequot": 9831, "fellas": 8500, "guild": 8497, "yayyyyy": 9709, "guinea": 8496, "halloween": 8495, "irony": 8491, "juliet": 8490, "kellyrowland": 8489, "kev": 8488, "kickass": 8487, "lad": 8486, "laps": 8485, "lobby": 8483, "lori": 8482, "mature": 8481, "pajamas": 8475, "pickle": 8473, "producer": 8471, "quotand": 8470, "quotnew": 8469, "quotnot": 8468, "readers": 8467, "ringtones": 8463, "rosie": 8461, "martini": 8620, "sailor": 8460, "scar": 8458, "scrabble": 8457, "teething": 8452, "throwdown": 8451, "tonfue": 8450, "tricky": 8449, "ak": 9377, "vice": 8447, "welcoming": 8445, "wohoo": 8444, "approaching": 8440, "attempts": 8438, "backk": 8437, "behalf": 8435, "bent": 8434, "bronchitis": 8430, "circles": 8428, "combined": 8427, "scones": 9814, "confusion": 8426, "couples": 8425, "dayyy": 8422, "dedication": 8421, "drill": 8419, "fuss": 8418, "fuzzball": 8417, "introducing": 8414, "jerks": 8413, "joshtastic1": 8412, "jumper": 8411, "leaning": 8410, "nasa": 8408, "overly": 8405, "poured": 8403, "profiles": 8402, "rp": 8396, "sized": 8394, "som": 8392, "surprising": 8390, "delight": 9436, "tutorials": 8388, "fn": 8927, "udah": 8387, "variety": 8386, "washer": 8385, "47": 8383, "verwon": 9717, "annoys": 8380, "attacking": 8379, "barbeque": 8378, "bitten": 8375, "bluetooth": 8373, "chickens": 8369, "crunchyk": 8368, "des": 8365, "dp": 8362, "flats": 8358, "hdd": 8356, "involves": 8353, "mami": 8348, "milan": 8347, "nova": 8343, "nsw": 8342, "opportunities": 8341, "planted": 8339, "procrastination": 8338, "skint": 8597, "provided": 8336, "punishment": 8335, "quothiquot": 8334, "sl": 8330, "sleeeep": 8329, "span": 8328, "specifically": 8327, "tokio": 8323, "usage": 8320, "vietnam": 8319, "voicemail": 8318, "whales": 8317, "wizards": 8316, "worm": 8315, "avenue": 8313, "awhh": 8312, "barking": 8311, "bestfriends": 8308, "stomachache": 9305, "blair": 8307, "blipfm": 8306, "brett": 8305, "byeee": 8303, "coaching": 8299, "comedyqueen": 8298, "cookin": 8297, "dept": 8296, "epiphanygirl": 8293, "erased": 8292, "exists": 8291, "feb": 8290, "flakes": 8289, "goldfish": 8288, "grabbing": 8287, "gravy": 8286, "hoppusday": 8282, "humble": 8281, "iamthecommodore": 8280, "ittt": 8277, "liam": 8273, "lv": 8272, "mimi": 8271, "module": 8270, "pencil": 8268, "quotit": 8265, "quotwhy": 8263, "stinking": 9306, "quotyoure": 8262, "remains": 8260, "samsung": 8258, "speaks": 8254, "supermarket": 8252, "titles": 8249, "ir": 9495, "todayyy": 8248, "vinyl": 8245, "worki": 8244, "youuuuu": 8241, "ze": 8240, "controller": 8230, "dateline": 8227, "reread": 8543, "eugh": 8226, "evidence": 8224, "floors": 8222, "gums": 8920, "greens": 8220, "grilling": 8219, "guyz": 8218, "hangovers": 8216, "heath": 8215, "heights": 8214, "instructions": 8211, "ipl": 8210, "laurie": 8209, "lenos": 8208, "lmaooo": 8207, "mafia": 8204, "frustration": 8770, "mansion": 8203, "mcflymusic": 8202, "mmwanted": 8199, "nausea": 8198, "outquot": 8196, "pam": 8195, "peppers": 8194, "perspective": 8193, "poland": 8192, "powder": 8190, "presentations": 8189, "screams": 8183, "solar": 8182, "stable": 8181, "stoopid": 8179, "tomm": 8177, "utter": 8175, "vacuum": 8174, "vi": 8173, "waving": 8171, "wiki": 8169, "wooh": 8168, "311": 8167, "alls": 8164, "applebees": 8162, "von": 9115, "battlefield": 8158, "chillaxin": 8156, "wizard": 9112, "cinderella": 8155, "divine": 8151, "drawn": 8150, "dreadful": 8149, "ehhh": 8146, "cameron": 8301, "encouraging": 8145, "in2": 8138, "keepin": 8136, "keri": 8135, "moore": 8131, "psh": 9324, "muchly": 8130, "noticing": 8126, "phillies": 8125, "rely": 8121, "remembers": 8120, "lilly": 9158, "renew": 8119, "reserve": 8117, "sadd": 8115, "samantharonson": 8114, "strangely": 8110, "therell": 8109, "sql": 9222, "tiredd": 8108, "truely": 8107, "spilt": 8893, "waters": 8105, "witness": 8103, "screwing": 8671, "wonderfully": 8101, "angie": 8097, "venezuela": 9791, "approval": 8096, "atmosphere": 8095, "conf": 8091, "critical": 8089, "designers": 8087, "distract": 8086, "tym": 9555, "drying": 8085, "professor": 8337, "employees": 8084, "float": 8081, "formula": 8080, "ftsk": 8078, "gin": 8077, "ginoandfran": 8076, "hairdresser": 8075, "jordin": 8069, "ky": 8068, "leadership": 8067, "lean": 8066, "lifting": 8065, "lincoln": 8064, "talents": 9720, "givin": 8694, "mojo": 8063, "owners": 8061, "polo": 8060, "prizes": 8059, "rave": 8058, "sicky": 8054, "thighs": 8053, "thursdays": 8052, "tits": 8051, "lotto": 9333, "typos": 8050, "wagon": 8049, "wrapping": 8047, "105": 8046, "acc": 8044, "alley": 8042, "audrey": 8039, "bingo": 8037, "celebrated": 8036, "ciara": 8035, "indo": 9595, "conditioner": 8033, "deadlines": 8030, "description": 8029, "fallout": 8027, "fi": 8025, "rihanna": 9818, "fought": 8024, "hatin": 8021, "ichat": 8019, "introduced": 8017, "jerrys": 8015, "likewise": 8014, "losers": 8013, "mampg": 8012, "marvin": 8010, "mock": 8009, "muh": 8008, "nao": 8007, "nerdy": 8006, "downtime": 8363, "nicholas": 8005, "impalaguy": 9847, "niggas": 8004, "pointing": 8000, "prepping": 7998, "presale": 7997, "grub": 9253, "rear": 7996, "scout": 7994, "karate": 9958, "shark": 7993, "deposit": 9093, "sod": 7990, "spock": 7989, "sprinkles": 7988, "statistics": 7987, "turkish": 7985, "vh1": 7980, "vic": 7979, "wells": 7978, "wer": 7977, "yeahi": 7976, "alton": 7974, "bts": 7971, "bubba": 7970, "compatible": 7969, "cpu": 7967, "cuter": 7966, "dial": 7965, "equally": 7962, "fifth": 7959, "glastonbury": 7958, "greater": 7957, "hips": 7955, "jsut": 7953, "kiwi": 7951, "leaking": 7949, "medication": 7945, "monopoly": 7943, "multi": 7941, "scratching": 8672, "nowww": 7940, "quotyour": 7937, "daycare": 8423, "riot": 7935, "slut": 7931, "apartments": 9702, "terry": 7929, "thn": 7926, "unbelievably": 7924, "velvet": 7923, "columbia": 9443, "1200": 7920, "ally": 7975, "430am": 7919, "4ever": 7918, "absolutly": 7917, "bells": 7914, "bfast": 7913, "blunt": 7912, "britain": 7910, "bu": 7909, "cheeseburger": 7908, "communicate": 7907, "scripts": 9568, "cryin": 7906, "depot": 7904, "diggin": 7903, "feat": 7902, "fin": 7901, "flea": 7900, "friendfeed": 7899, "gabe": 7897, "hahahha": 7894, "helmet": 7892, "irvine": 7888, "68": 8587, "knit": 7886, "laser": 7885, "lick": 7884, "loveeee": 7883, "madd": 7882, "mercy": 7881, "mu": 7878, "rebel": 8466, "performed": 7876, "princesssuperc": 7875, "shabby": 9644, "prototype": 7874, "fruits": 9178, "quitting": 7873, "rehab": 7872, "retired": 7870, "sayang": 7869, "sheffield": 7867, "sos": 7866, "vicky": 8659, "stations": 7865, "symphnysldr": 7864, "syndrome": 7863, "thy": 7861, "signature": 9131, "tru": 7857, "wha": 9045, "victim": 7855, "wandering": 7853, "wilson": 7851, "wonderland": 7850, "37": 7847, "5000": 7846, "anderson": 7845, "attended": 7842, "cara": 7840, "chairs": 7838, "choosing": 7837, "christine": 7835, "continuing": 7834, "courage": 7833, "develop": 7831, "devon": 7830, "blushing": 9886, "dictionary": 7829, "driven": 7826, "drupal": 7825, "exhibition": 7823, "gears": 7821, "heavily": 7820, "instantly": 7817, "i\u2019m": 7816, "lancearmstrong": 7814, "outlet": 7809, "basis": 8436, "parks": 7807, "perfume": 7805, "playground": 7803, "portable": 7802, "rec": 7799, "mill": 9663, "reporting": 7797, "resident": 7796, "scifi": 7795, "shines": 7794, "snapped": 7792, "throws": 7790, "timequot": 7789, "twhirl": 7787, "affair": 7785, "aloe": 7784, "amongst": 7783, "avail": 7782, "belle": 7780, "beware": 7779, "clueless": 7778, "damm": 7776, "don\ufffdt": 7773, "downer": 7772, "enuff": 7770, "equals": 7769, "itt": 7763, "jamieoliver": 7762, "melb": 9154, "noe": 7756, "okie": 7755, "oreos": 7754, "potty": 7751, "reviewing": 7748, "lenses": 8557, "sequel": 7746, "slot": 7745, "tlc": 7742, "trained": 7741, "tribute": 7740, "upi": 7736, "venture": 7735, "viva": 7734, "widget": 7732, "yas": 9211, "wisconsin": 7731, "witty": 7730, "yeaah": 7729, "106": 8800, "08": 7728, "bots": 7724, "doughnuts": 7720, "fricken": 7718, "gailporter": 7717, "greedy": 7716, "grows": 7715, "hiii": 7714, "jayme1988": 7711, "worldwide": 9290, "kasi": 7710, "moody": 7942, "kristin": 7709, "lou": 7707, "repairs": 8901, "mentions": 7703, "organize": 7702, "overdue": 7701, "petition": 7699, "samples": 7695, "shhh": 7692, "skittles": 7691, "funnn": 7898, "subjects": 7689, "ellie": 7719, "swiss": 7688, "tunnel": 7686, "und": 7685, "witch": 7682, "nessie111": 9410, "xboxe3": 7681, "100000": 7680, "2006": 7679, "launching": 9246, "88": 7677, "bolt": 7671, "buggy": 7670, "bullet": 7669, "clown": 7668, "comeback": 7667, "diva": 7665, "dive": 7664, "enuf": 7662, "techno": 8250, "fro": 7659, "gov": 7658, "itch": 7656, "jar": 7655, "cho": 9616, "madre": 7653, "newly": 7648, "oct": 7647, "offering": 7646, "participate": 7644, "preparation": 7643, "remedy": 7642, "shelf": 7639, "sources": 7638, "supports": 7636, "temporarily": 7632, "ughhhhh": 7630, "unfortunatly": 7629, "vbs": 7628, "whyy": 7626, "fuckcity": 8637, "120": 7625, "4ward": 7623, "adults": 7621, "alancarr": 7620, "americas": 7618, "anyhow": 7617, "blake": 7616, "bruno": 7615, "carlos": 7614, "char": 7613, "smores": 9226, "chilli": 7612, "cigarettes": 7611, "evenings": 7768, "cindy": 7610, "rockband": 8185, "curled": 7609, "digg": 7607, "fletcher": 8571, "elementary": 7606, "explaining": 7605, "facts": 7603, "firefly": 7600, "gavin": 7598, "getaway": 7597, "limeice": 9844, "ghosts": 7596, "granted": 7594, "har": 7593, "humour": 7592, "meanwhile": 8553, "kreme": 7590, "languages": 7589, "launched": 7588, "liquid": 7586, "loove": 7585, "mampms": 7584, "mn": 7581, "nk": 7580, "nudge": 7579, "oy": 7577, "placed": 7576, "promoting": 7575, "pups": 7574, "silverstone": 7573, "spelt": 7572, "temple": 7568, "vocal": 7565, "inevitable": 8916, "welll": 7564, "clothdiapers": 8154, "unite": 7738, "102": 7562, "1111": 7561, "sinking": 9928, "43": 7560, "actors": 7559, "altho": 7558, "analysis": 7557, "anyones": 7556, "asses": 7554, "cave": 7552, "champion": 7550, "ferry": 7543, "fishy": 7541, "hahahahahaha": 7540, "hopping": 7537, "ini": 7535, "ken": 7534, "manny": 7531, "omgg": 7529, "quothey": 7523, "reasonable": 7522, "relaxation": 7520, "retire": 7519, "revolution": 7518, "riandawson": 7517, "rusty": 7516, "switzerland": 7514, "tellin": 7513, "trading": 7512, "lk": 9843, "trent": 7511, "warned": 7510, "wired": 7509, "yang": 7508, "rod": 9570, "abroad": 7506, "moth": 9834, "adds": 7505, "adopted": 7504, "assembly": 7502, "blurry": 7500, "bn": 7499, "cherries": 7495, "abbey": 9544, "column": 7494, "das": 7492, "guitars": 8849, "deaf": 7490, "ts": 7856, "doom": 7488, "giddy": 7485, "totes": 9557, "gtg": 7483, "crisps": 8711, "lala": 7481, "maryland": 7480, "peaches": 7477, "pony": 7474, "probly": 7473, "prof": 7472, "quotall": 7471, "retweets": 7469, "sarcastic": 7467, "wala": 8048, "scale": 7466, "shutting": 7463, "slam": 7462, "sweep": 8178, "splash": 7461, "twitterer": 7457, "butterflies": 7498, "ustream": 7455, "vent": 7454, "vou": 7453, "zackalltimelow": 7451, "advert": 7448, "banquet": 7446, "can\u00b4t": 7443, "coollike": 7442, "deff": 7441, "brandy": 8946, "funk": 7434, "jamba": 7430, "kissing": 7427, "lifestyle": 7426, "suprised": 9561, "manhattan": 7424, "merch": 7422, "nearest": 7421, "painkillers": 7419, "harris": 8283, "pas": 7418, "produce": 7415, "qld": 7414, "quizzes": 7413, "rogers": 7411, "saga": 7409, "sizes": 8113, "sane": 7408, "eu09": 9515, "slacking": 7404, "stevie": 7402, "throbbing": 7400, "watches": 7399, "wes": 7398, "44": 7396, "agony": 7394, "noob": 9833, "animation": 7393, "brighten": 7391, "chart": 7390, "classroom": 7388, "coool": 7387, "dash": 7384, "debt": 7383, "dreary": 7382, "economics": 7381, "woof": 8590, "finna": 7378, "geo": 7377, "gravity": 7376, "hopeless": 7374, "knowi": 7371, "marcus": 7370, "partay": 7367, "t4": 8251, "pilates": 7366, "mysql": 8752, "portuguese": 7364, "pussy": 7363, "fcking": 8700, "robbed": 7362, "spit": 7359, "tehran": 7357, "tweeples": 7355, "uhoh": 7354, "unusual": 7353, "canvas": 9200, "watering": 7352, "munich": 8753, "yarn": 7351, "awaits": 7347, "bahamas": 7346, "convert": 7341, "courtesy": 7340, "dances": 7339, "dk": 7337, "effective": 7335, "elvis": 7334, "excuses": 7333, "feliciaday": 7331, "floating": 7330, "yw": 8727, "glow": 7329, "raising": 8603, "govt": 7328, "hahahahah": 7327, "internal": 7324, "involve": 7323, "consumed": 9984, "krisallenmusic": 7322, "nerds": 7318, "overseas": 7317, "paige": 7316, "raid": 7314, "tennessee": 7310, "toss": 7308, "vampires": 7307, "willieday26": 7305, "practical": 7525, "asda": 7301, "basket": 7300, "becuz": 7299, "fires": 9602, "border": 7297, "injuries": 8071, "buck": 7295, "colorblindfish": 7293, "commentary": 7292, "polite": 9823, "coupon": 7291, "detail": 7290, "dmv": 7289, "elsewhere": 7287, "equipment": 7286, "facial": 7285, "fog": 7283, "gap": 7282, "gomez": 7279, "ironic": 7274, "meantime": 7273, "para": 7268, "permission": 7267, "poke": 7266, "raspberry": 7265, "reaching": 7264, "sixteen": 9810, "recall": 7263, "puffy": 7315, "require": 7262, "sip": 7793, "rising": 7261, "rubber": 7259, "shontellelayne": 7257, "soggy": 7256, "solangeknowles": 7255, "whatsoever": 8806, "spirits": 7254, "teenager": 7253, "\u00ac\u00ac": 7249, "\u0438": 7248, "alllll": 7246, "thankss": 8735, "argue": 7245, "cheered": 7243, "cn": 7242, "coincidence": 7240, "showtime": 9311, "cracker": 7238, "creativity": 7237, "buti": 8232, "developed": 7233, "beverly": 9370, "developing": 7232, "entries": 7230, "experiencing": 7229, "phils": 9325, "festivities": 7228, "rn": 7934, "forehead": 7225, "dwn": 7663, "glue": 7223, "heating": 7221, "lasagna": 7216, "robots": 8259, "shawn": 7360, "nathanfillion": 7213, "minimum": 7880, "neglecting": 7212, "pollen": 7209, "programme": 7208, "researching": 7206, "rushing": 7205, "leaf": 9336, "sherrieshepherd": 7203, "ddub": 7338, "soak": 7202, "tablets": 7200, "tila": 7199, "toddler": 7198, "underneath": 7196, "530am": 7193, "adopt": 7192, "auditions": 7190, "certificate": 9617, "badge": 7189, "sickk": 8669, "bleed": 7187, "cole": 7184, "criminal": 7183, "degrassi": 7181, "dexter": 7179, "embarrassed": 7177, "gloves": 7176, "hashtag": 7175, "iloveyou": 7173, "imy": 7172, "johnlloydtaylor": 7170, "keynote": 7168, "lb": 7167, "lego": 7166, "lindsay": 7165, "bouncing": 8869, "lineup": 7164, "overload": 7163, "pleasee": 7162, "rlly": 7159, "seafood": 7158, "730am": 9110, "showering": 7157, "sinuses": 8817, "sniffle": 7156, "survey": 7153, "ticklemejoey": 7152, "vibe": 7151, "wan": 7149, "weee": 7148, "welli": 7147, "wiv": 7146, "wrecked": 7145, "dissertation": 8705, "accepting": 7138, "ahem": 7137, "angela": 7135, "beaches": 7133, "cabin": 7132, "74": 9897, "pst": 8826, "condo": 7129, "definition": 7128, "ding": 7127, "distracting": 7126, "district": 7125, "frown": 8499, "editor": 7122, "engaged": 7120, "fees": 7118, "roomies": 8462, "woe": 7304, "fierce": 7117, "serial": 8538, "inspire": 7115, "subscribers": 7571, "jenn": 7114, "mbp": 7112, "nancy": 7110, "pause": 7104, "pb": 7103, "pies": 7102, "pins": 7101, "pumpkin": 7098, "quothappy": 7097, "relaxin": 7095, "sans": 7093, "taxes": 7089, "tweetin": 7088, "vets": 7087, "whack": 7085, "shouting": 8395, "38": 7083, "awwh": 7081, "bookstore": 7079, "checks": 7076, "mustard": 9068, "wakin": 8446, "deffo": 7074, "formal": 7072, "freshman": 7486, "fortunately": 7071, "mashed": 9743, "giggles": 7070, "hobby": 7068, "itz": 7067, "length": 7066, "lisaveronica": 7065, "livin": 7064, "rockets": 8742, "lousy": 7063, "mens": 7062, "nan": 7061, "ou": 7058, "platform": 7056, "colleague": 9612, "sneaky": 7053, "danecook": 7905, "terminal": 7631, "plaza": 7365, "tabs": 7051, "mistaken": 8759, "tropical": 7048, "wld": 7046, "insist": 9339, "zune": 7045, "agency": 7043, "bfs": 7041, "chu": 8940, "cedar": 7040, "charming": 7039, "eddie": 7037, "empire": 7036, "enjoyin": 7034, "fob": 7031, "forcing": 7030, "nya": 9485, "goodsex": 7029, "grandfather": 7028, "howdy": 7027, "increase": 7026, "iplayer": 7025, "jill": 7022, "jtimberlake": 7021, "maggie": 7019, "ultra": 7739, "migraines": 7017, "reinstall": 7015, "restart": 7013, "screening": 7012, "reinstalling": 9572, "supposedly": 7635, "sesh": 7011, "slave": 7010, "unloved": 7737, "soz": 7008, "coop": 7777, "themes": 7006, "tofu": 7005, "againquot": 8795, "yorkshire": 7002, "alien": 6999, "bailey": 6998, "cheeky": 6996, "cock": 6995, "covering": 6994, "crown": 6993, "yknow": 7143, "dani": 6992, "dearly": 6991, "dental": 6990, "goto": 6987, "highest": 6985, "posh": 8191, "inviting": 6983, "irritating": 6982, "releases": 9320, "jp": 6980, "kung": 6978, "limits": 6976, "gta": 8565, "mariah": 6975, "mileys": 6974, "nauseous": 6973, "newbie": 6972, "coraline": 8228, "oj": 6971, "patiently": 6969, "permanent": 6968, "squeeze": 6965, "theirs": 6961, "115": 8799, "protein": 7801, "wendy": 6959, "banks": 6953, "causes": 6952, "chad": 6951, "chew": 6950, "sth": 9642, "cleaner": 6948, "connor": 6946, "achievement": 9542, "offices": 7578, "dayi": 6945, "delightful": 6943, "ghetto": 6941, "hotels": 6938, "hush": 6937, "impatient": 6936, "influence": 6934, "jobros": 6931, "ebook": 9183, "noah": 6930, "ohhhhh": 6929, "pcd": 6928, "pimp": 6926, "rc": 6925, "ringtone": 6923, "sams": 6921, "spice": 6919, "tags": 6917, "tai": 6916, "newport": 8549, "tiff": 6914, "visits": 6912, "investment": 9678, "familys": 8643, "wheat": 6911, "boreddd": 9032, "whyyy": 6910, "\u043d\u0435": 6909, "110": 6908, "96": 6907, "breast": 6906, "cont": 6902, "era": 6898, "firmware": 6897, "grabbed": 6896, "hundreds": 6894, "icarly": 6893, "bollocks": 8786, "bore": 7296, "ideal": 6892, "kindly": 6891, "processing": 8187, "meets": 6889, "ancient": 8041, "od": 6886, "pedicure": 6884, "psyched": 6883, "harlem": 9751, "ranch": 6882, "richmond": 6880, "roadtrip": 6878, "flooding": 8639, "chopped": 7836, "smoked": 6877, "veg": 6874, "whip": 6871, "otw": 9146, "ym": 6870, "spike": 9308, "yummm": 6869, "artwork": 6866, "bac": 6865, "fond": 7226, "derek": 6863, "charleston": 9445, "leftover": 6856, "masters": 6855, "msgs": 6853, "fossiloflife": 9347, "nominated": 6851, "registration": 6847, "roads": 6846, "rumor": 6845, "tearing": 7862, "scores": 6844, "searched": 6843, "sells": 6842, "osx": 8834, "deeply": 7182, "tab": 6840, "tc": 6839, "womens": 6836, "28th": 6835, "connections": 6834, "daw": 9191, "corporate": 6833, "eachother": 6830, "entering": 6829, "flatley": 6827, "gloom": 6826, "linda": 6824, "cornwall": 9094, "mixtape": 6822, "mod": 6821, "wme": 9212, "natal": 6820, "odds": 6818, "paycheck": 6814, "approach": 7916, "promises": 6813, "regularly": 6811, "fearless": 9428, "rented": 6810, "secretly": 6809, "shits": 6808, "tay": 6806, "bench": 8582, "thnk": 6805, "addition": 6803, "algebra": 6802, "russia": 7995, "conclusion": 6800, "cabinet": 9881, "earl": 6798, "flipping": 6796, "googled": 6795, "hamilton": 6792, "hurray": 6791, "document": 9017, "intelligent": 8018, "lists": 6787, "magazines": 6786, "modem": 6785, "moods": 6784, "backs": 7042, "nobodys": 6782, "peed": 6780, "premier": 6779, "punched": 6777, "python": 6776, "seth": 7406, "sensitive": 6775, "thousands": 6774, "tink": 6773, "tj": 6772, "unwell": 6770, "ve": 6769, "wrestling": 6767, "admitted": 9379, "activities": 6766, "assistant": 6764, "owie": 9144, "backed": 6763, "chap": 8577, "breakdown": 6761, "brief": 6760, "brill": 6759, "chaos": 6758, "espn": 6757, "explains": 6756, "gahhh": 6755, "howre": 7174, "kiddies": 6750, "labor": 6749, "okayy": 6746, "freshly": 8357, "redbull": 6745, "requested": 6743, "runnin": 6742, "sticker": 6740, "t20": 6739, "thoroughly": 6738, "utah": 6734, "waaay": 6733, "whered": 6731, "wifes": 6730, "250": 6729, "poopy": 9655, "97": 6728, "bali": 6727, "becca": 6726, "talaga": 8664, "bryan": 6722, "cities": 6720, "clicking": 6719, "connecting": 6718, "cooper": 6717, "desire": 6714, "diary": 6713, "expectations": 6711, "funds": 6709, "geeks": 6708, "iranian": 6705, "johnson": 6703, "lacking": 6701, "lautner": 6700, "midterm": 6699, "n97": 6698, "nachos": 6697, "orleans": 6695, "payday": 6694, "persons": 6693, "protection": 6692, "relatives": 6690, "rocket": 6689, "yew": 7921, "snowing": 6687, "thailand": 6686, "toll": 6685, "treasure": 6684, "tablet": 8534, "costa": 6716, "walkin": 6683, "xdd": 6682, "yg": 6681, "41": 6680, "alpha": 6679, "autumn": 6677, "backwards": 6676, "boredd": 6675, "colin": 6673, "damaged": 6671, "dday": 6670, "dong": 6669, "edited": 6667, "fc": 7660, "juicy": 6664, "neighbour": 6661, "poll": 6659, "slim": 6657, "smack": 6656, "sowwy": 6655, "tasks": 6654, "tnx": 6653, "exception": 8223, "tomo": 6652, "veggies": 6650, "yung": 6649, "boxing": 6647, "bristol": 6646, "chop": 6644, "leighton": 9592, "delhi": 6641, "discovery": 6640, "flavor": 6637, "gals": 6636, "grammar": 6635, "owwww": 9829, "hassle": 6634, "icing": 6633, "kewl": 6631, "ooops": 6628, "quicker": 6626, "quotwe": 6625, "heyyyy": 8020, "underwear": 6651, "sally": 6623, "scroll": 6622, "warn": 9716, "separate": 6621, "stereo": 6620, "ecstatic": 9863, "stinky": 6619, "stroke": 6618, "tmw": 6617, "skill": 7932, "discussing": 6942, "twitted": 6616, "wuz": 6614, "baltimore": 6612, "bastards": 6610, "benefits": 6609, "sweetness": 9721, "folding": 8925, "browsing": 6607, "credits": 6605, "depending": 6604, "directions": 6603, "director": 6602, "opps": 9947, "dwight": 6599, "forth": 6597, "gooooood": 6596, "intended": 6594, "interface": 6593, "julian": 6592, "km": 6591, "liquor": 6589, "rug": 9726, "majorly": 6586, "smashing": 9227, "mets": 6585, "nerve": 6584, "nina": 6581, "noww": 6580, "oklahoma": 6579, "kettle": 7815, "packet": 6578, "jean": 7023, "straighten": 7007, "philosophy": 6575, "preorder": 6574, "rage": 6573, "tara": 6570, "ths": 6567, "tuition": 6564, "tut": 6563, "guard": 6793, "visitors": 6561, "abuse": 6560, "admire": 6559, "aiden": 6558, "arghhh": 6557, "athens": 6556, "christina": 6554, "mikes": 7582, "cleared": 6553, "cocoa": 8034, "concern": 6551, "charlies": 9694, "oreo": 7527, "database": 6548, "diner": 6547, "espresso": 6545, "fiesta": 6544, "fluffy": 6543, "heeey": 6541, "html": 6540, "incident": 6537, "inlaws": 6536, "input": 6535, "leaked": 6532, "marie": 6531, "milo": 6529, "nonsense": 6527, "oooooh": 6526, "outdoors": 6525, "ashleyltmsyf": 8040, "portugal": 6523, "rehearsals": 6520, "rep": 6519, "sausages": 6517, "sleeve": 8393, "shadow": 6515, "shampoo": 6514, "sneeze": 6513, "stitches": 6511, "sucker": 6510, "tomarrow": 6508, "restored": 9233, "waaaay": 6507, "wethetravis": 6506, "wp": 6505, "900": 6504, "woops": 8525, "alyssa": 6503, "cullen": 6498, "danielle": 6497, "darlin": 6496, "dhughesy": 6495, "dragged": 6493, "coffe": 7241, "earned": 6492, "exit": 6491, "fitting": 6489, "focused": 6488, "jennifer": 6483, "manual": 6480, "ditched": 6601, "moi": 6479, "parked": 6473, "pero": 6472, "personality": 6471, "presence": 6470, "portion": 9941, "sammy": 6468, "shaved": 6467, "shuttle": 6466, "galaxy": 7599, "towers": 6463, "troubles": 6461, "weddings": 6460, "yday": 6459, "auction": 6456, "unhealthy": 8960, "ban": 6455, "borders": 6453, "brittany": 6451, "flops": 6446, "froze": 6445, "savannah": 7747, "guts": 6444, "superman": 6571, "invisible": 6442, "laughhave": 6441, "lc": 6440, "leopard": 6439, "listing": 6438, "method": 6435, "mis": 6434, "ut": 7982, "planes": 6433, "diddy": 6862, "rockstar": 6431, "seminar": 6430, "seo": 6429, "smelling": 6427, "submit": 6426, "naww": 8345, "unavailable": 8106, "fiction": 7227, "surrounded": 6425, "thisisrobthomas": 6424, "timefollow": 6423, "1s": 8797, "badass": 5711, "translate": 6422, "academy": 6419, "dey": 9188, "ana": 6418, "boooooo": 6417, "bumped": 6416, "president": 4602, "coughing": 2669, "15": 858, "cardiff": 6415, "broadcasting": 9100, "pat": 4269, "ceiling": 6414, "worms": 9289, "78": 8443, "cobra": 6411, "homee": 6405, "includes": 6404, "dos": 9187, "kindle": 6403, "lax": 6401, "loan": 6399, "tube": 3742, "nate": 6396, "ourselves": 5072, "origin": 6393, "smokin": 8895, "speeding": 6390, "musician": 8479, "clap": 6904, "wossy": 3102, "spoilers": 6389, "grandpa": 3179, "thnks": 6386, "sparks": 8453, "os": 1703, "visual": 6384, "mil": 9331, "630am": 6383, "lamp": 9001, "sofa": 3712, "shore": 5882, "abby": 6382, "byee": 6378, "copies": 6374, "drs": 6372, "entertained": 6371, "knoww": 6365, "policy": 6360, "counting": 1892, "protect": 6359, "storm": 1207, "mega": 3808, "purchased": 6358, "discovering": 9351, "used": 466, "swallow": 6354, "uncles": 6351, "inn": 7818, "playin": 2782, "wi": 6349, "ashes": 6346, "banner": 6345, "blueberry": 6344, "ikea": 3696, "sweat": 3745, "buds": 6342, "buses": 6341, "rise": 2656, "colours": 6339, "columbus": 6338, "wikipedia": 6958, "cheers": 1361, "kayla": 6330, "title": 2660, "wardrobe": 6322, "sandy": 8541, "angel": 2191, "annoy": 6319, "applying": 6318, "txt": 1930, "crackers": 6312, "nephew": 2507, "grant": 6310, "outs": 5789, "lappy": 6308, "laurens": 6307, "situation": 2239, "mileymonday": 6303, "monkeys": 6302, "preordered": 6300, "cranky": 4258, "psychology": 6299, "fishing": 3160, "stands": 6296, "nbc": 4803, "2007": 6292, "roots": 5141, "blush": 6289, "bravo": 9277, "accidentally": 2981, "yahoo": 2920, "boards": 6288, "stuffy": 4822, "devastated": 6285, "curtains": 9355, "dwighthoward": 6283, "whoever": 3458, "hs": 3592, "foundation": 6282, "ramen": 6215, "glee": 6281, "jt": 6276, "violence": 6873, "crowded": 6549, "animal": 2414, "leah": 6275, "loses": 6274, "mrtweet": 6273, "romance": 6269, "pandora": 6019, "marks": 3859, "unemployed": 6264, "bubbles": 6257, "developers": 7489, "abandoned": 5085, "camper": 6256, "err": 4628, "commute": 6255, "flag": 6254, "gi": 6253, "robluketic": 9132, "documentary": 6335, "navy": 6249, "wonder": 762, "ooooo": 6246, "roomie": 6244, "tidying": 6243, "tp": 6242, "travis": 6241, "bleeding": 3630, "27th": 6238, "getting": 128, "classmates": 6233, "cell": 1388, "dancer": 6231, "bea": 7188, "davids": 6230, "capital": 6500, "heavy": 1763, "suicide": 5548, "destroy": 6229, "refused": 7798, "dew": 6228, "hammer": 6224, "invented": 6223, "recommends": 8398, "laters": 6222, "rubbing": 5822, "madrid": 6221, "27": 3524, "offended": 6118, "mam": 6220, "biscuits": 5112, "ofcourse": 6218, "bonnaroo": 9369, "toward": 9299, "resist": 3805, "gathering": 5703, "outing": 6217, "pg": 6576, "city": 618, "pace": 6216, "sin": 6211, "yeay": 7849, "bun": 7077, "tables": 6209, "unknown": 6208, "chats": 6412, "withdrawal": 6205, "sisters": 1274, "exited": 6409, "\u2013": 5841, "zack": 6204, "raging": 9401, "bam": 6202, "cider": 6199, "alice": 4131, "confidence": 6196, "sched": 9316, "sermon": 8896, "pizza": 878, "guests": 5230, "davidhenrie": 6195, "homes": 5858, "dw": 6193, "banksyart2": 8872, "hosting": 3659, "humans": 6189, "illness": 6188, "gadget": 6368, "gooo": 6542, "medium": 6184, "nyt": 6182, "pleaseee": 6180, "resort": 6178, "thnx": 2444, "sheesh": 6176, "bend": 8235, "2b": 7350, "scored": 4908, "speaker": 6175, "spy": 6174, "yippee": 7563, "tyrese4real": 6171, "lols": 5189, "zomg": 6168, "word": 715, "ford": 6369, "department": 6163, "disagree": 6162, "goodbyes": 6155, "hunter": 6154, "icons": 6153, "label": 6150, "snoring": 5521, "printed": 6147, "90": 2557, "rs": 6144, "stuff": 282, "sarcasm": 6143, "swag": 6140, "thanking": 6138, "anti": 9703, "xmas": 6137, "same": 247, "poetry": 5471, "attached": 6135, "bo": 6132, "stranded": 7312, "pooped": 5887, "cal": 6131, "inner": 6122, "maps": 6121, "bathroom": 2178, "psych": 6112, "fighter": 7601, "decides": 6944, "safety": 6111, "lewis": 5146, "towel": 6104, "various": 6103, "cyrus": 2449, "amandapalmer": 6101, "gue": 6093, "real": 400, "kickin": 6090, "sec": 4120, "printing": 6087, "retweeting": 6085, "default": 4694, "smash": 6081, "chk": 9986, "snake": 6080, "steel": 6079, "black": 752, "grrr": 1727, "stink": 6078, "trace": 6075, "particularly": 4880, "viewing": 6074, "western": 6102, "gl": 8568, "grandmother": 5396, "struggle": 6077, "branch": 8431, "gmorning": 4792, "bb": 1090, "ada": 6071, "yours": 973, "cody": 6066, "presenting": 9480, "april": 2677, "dreamt": 6064, "tshirt": 2211, "whiskey": 6169, "fella": 6063, "lane": 6057, "speedy": 8253, "leo": 6056, "tagged": 9560, "loll": 6055, "r": 398, "rate": 2837, "misss": 6054, "dirty": 1854, "pirates": 6052, "depressed": 1267, "salmon": 6049, "gotta": 301, "stickam": 6047, "jon": 1192, "tries": 6040, "graphic": 4393, "whom": 6039, "clinic": 6034, "celebration": 3831, "offered": 4703, "countries": 6032, "definatly": 9869, "ftl": 5993, "austin": 2685, "craft": 6031, "alert": 5649, "egypt": 6028, "rhymes": 9232, "happily": 4977, "fk": 6026, "madison": 6024, "math": 1131, "rally": 6016, "refreshed": 6015, "replay": 6014, "summit": 6012, "tick": 6011, "twitpics": 6010, "1500": 7624, "universal": 6009, "brick": 6005, "earrings": 5999, "estate": 5997, "generation": 5992, "square": 2993, "matches": 5986, "shaunjumpnow": 5980, "suitcase": 5977, "soooo": 598, "rafa": 4415, "tivo": 5976, "treated": 5974, "tutorial": 5973, "appearance": 5967, "benefit": 5966, "intervention": 9679, "bra": 5964, "cheat": 5961, "realizing": 4824, "gb": 5955, "hangout": 5954, "hoe": 5953, "kinds": 3562, "hunger": 5952, "dramatic": 7827, "ping": 5946, "hid": 9082, "remain": 5944, "retro": 8464, "stream": 2473, "remaining": 5943, "sample": 5942, "sipping": 5941, "outfits": 8197, "experienced": 6828, "incredible": 2469, "sleeep": 5940, "addiction": 3329, "throughout": 5938, "irritated": 5988, "boys": 629, "accounting": 5934, "applications": 5932, "disappear": 5931, "streaming": 4371, "jungle": 5926, "natalie": 5923, "newspaper": 5922, "oregon": 5921, "southern": 4373, "reallly": 5919, "surprises": 5917, "slipped": 6141, "tesco": 5916, "utterly": 5914, "tierd": 7986, "kk": 4708, "wheels": 5913, "amazingg": 9282, "brit": 5908, "cu": 5904, "downside": 5902, "xd": 574, "hittin": 5897, "vodafone": 8172, "hum": 5895, "post": 465, "crap": 567, "jan": 5894, "squirrel": 5291, "jewelry": 5893, "skills": 2807, "logging": 5890, "russell": 5886, "serving": 5884, "dawnrichard": 5314, "10k": 5873, "argument": 5871, "author": 5870, "bathing": 5869, "misskeribaby": 8905, "creed": 8778, "popular": 2843, "booking": 5868, "insomniac": 9166, "flooded": 5866, "glory": 5863, "richard": 4223, "guessed": 5862, "sac": 6213, "hack": 5861, "couldnt": 405, "attending": 4218, "hidden": 5859, "nanny": 5851, "promotion": 5850, "hollie": 7764, "retail": 5848, "rustyrockets": 5847, "specially": 5846, "boob": 9885, "imagination": 7536, "inc": 7218, "nuggets": 3679, "translation": 5844, "200": 2053, "zoe": 6007, "au": 5837, "msg": 2730, "clearing": 5834, "cooks": 5833, "fee": 5829, "foreign": 5828, "cookout": 6606, "gulpanag": 5827, "imax": 5825, "juss": 5824, "ow": 1868, "overtime": 5823, "400": 3565, "suggested": 5819, "yur": 5814, "butterfly": 5809, "callin": 5808, "cnn": 5806, "gets": 535, "confident": 5804, "frankie": 5799, "machines": 5794, "nicely": 3003, "meg": 5792, "concerts": 3201, "taught": 4080, "pacific": 5788, "ringing": 5786, "shade": 5785, "race": 1391, "arriving": 5780, "automatically": 6678, "former": 5079, "brownie": 5779, "comcast": 5778, "crisis": 5776, "sharp": 5883, "friendster": 8570, "dennys": 5775, "hammock": 8217, "dj": 2514, "justice": 5766, "pakcricket": 9737, "kudos": 5765, "well": 67, "needles": 5758, "tooooo": 4685, "pill": 5756, "rd": 6924, "strep": 5753, "trail": 5752, "upper": 5751, "djing": 9262, "hahha": 5734, "wallpaper": 5748, "shipped": 6110, "wing": 5747, "yell": 5746, "bananas": 5745, "heheh": 6278, "bbm": 5744, "burrito": 5741, "haveyouever": 5733, "brains": 6235, "backing": 6762, "idiots": 5731, "kiddo": 5729, "lmaoo": 5727, "nathan": 5724, "developer": 5801, "matty": 8683, "stressed": 1963, "pinky": 5719, "value": 4118, "stayin": 6048, "responsible": 5718, "leak": 5532, "steam": 5716, "childrens": 5709, "pcs": 6927, "cuddles": 5706, "areas": 8653, "write": 627, "defo": 5705, "pals": 6850, "je": 5700, "js": 5699, "zip": 8100, "kingdom": 5698, "mmmmmm": 5694, "seed": 8898, "quothow": 5693, "rolled": 5691, "brewing": 8304, "dose": 4981, "fruit": 2386, "sweater": 5687, "lesson": 1594, "understood": 5685, "volume": 5683, "tech": 2106, "5k": 5682, "bruise": 5678, "cud": 4420, "burst": 5676, "arrested": 6502, "kit": 4138, "cs": 5675, "dragging": 5674, "hii": 5672, "everybodys": 8143, "homeless": 5671, "infamous": 5669, "barn": 8310, "iti": 5668, "magical": 5665, "regarding": 5659, "sem": 9397, "treats": 5653, "intense": 3301, "sunburn": 1769, "cartoons": 5646, "fame": 5645, "houston": 2615, "pale": 5637, "lance": 9247, "playoffs": 5635, "recovered": 5633, "ks": 9418, "dallas": 2150, "computers": 2877, "suite": 5631, "hardware": 6279, "worlds": 3495, "supply": 5630, "imho": 9848, "vitamin": 5625, "25th": 5213, "arghh": 5621, "socal": 7690, "infront": 7373, "floor": 1483, "autograph": 5620, "casa": 5619, "chloe": 5618, "relationship": 3237, "adore": 3709, "errors": 5615, "ugg": 9296, "holes": 5613, "molly": 5609, "hungry": 572, "yayy": 3184, "pound": 5606, "wembley": 5602, "wolf": 5601, "rings": 4003, "advertising": 5599, "golfing": 7432, "approve": 5598, "rafael": 9402, "caring": 5595, "i\u00b4m": 3090, "ja": 5951, "flick": 4793, "crab": 5593, "havin": 2030, "dubai": 5590, "ulcer": 9217, "nickname": 6583, "cellphone": 5907, "dooo": 8704, "fearnecotton": 5588, "kevinjonas": 8910, "freeze": 5587, "leading": 6025, "ab": 6136, "mowing": 5585, "sweetheart": 3187, "mwah": 5583, "parent": 5582, "gma": 6126, "pump": 5579, "obrien": 9580, "spamming": 5574, "resources": 8823, "thang": 5573, "bizarre": 8374, "nu": 6219, "tn": 5572, "11am": 5570, "noble": 8750, "havnt": 2925, "anthony": 5568, "broadcast": 5836, "therealtiffany": 6915, "colds": 5567, "culture": 5564, "wicked": 2214, "dodgers": 5563, "911": 9545, "swear": 1527, "hundred": 5560, "italy": 2173, "jerry": 5559, "quotso": 7800, "mickey": 5557, "yasmina": 8877, "might": 285, "ages": 1280, "247": 5781, "skins": 6324, "northern": 5556, "buat": 8580, "dh": 4408, "practicing": 5553, "roland": 8184, "rove1974": 5551, "leave": 344, "strip": 5549, "gm": 3717, "wayne": 5547, "1230": 5546, "doctor": 1309, "aku": 5544, "begging": 5543, "comming": 5541, "waaaaay": 9552, "else": 469, "ego": 5536, "gem": 8498, "36": 5545, "howard": 5534, "suspect": 5518, "hehehehe": 6939, "tuesdays": 5515, "activity": 5512, "oddly": 7270, "archie": 5510, "nxt": 3443, "convention": 5565, "twittering": 1326, "compare": 5506, "she": 137, "danced": 5505, "drained": 5503, "ehh": 5502, "behave": 8514, "lay": 1597, "hubs": 5501, "kristenstewart9": 5499, "mars": 5498, "neva": 5497, "po": 5525, "creeping": 9981, "suggestion": 4096, "oatmeal": 5496, "photographer": 5495, "pilot": 5494, "programs": 5491, "youngest": 5623, "sink": 5488, "spreading": 5487, "stray": 9639, "duty": 2590, "avoiding": 5482, "landing": 7321, "unbelievable": 6265, "belt": 5480, "curve": 5478, "dunkin": 5477, "indiana": 5475, "wrap": 3779, "promote": 5173, "pole": 5470, "races": 5468, "hoped": 4211, "router": 5466, "shrimp": 5464, "stewart": 5461, "are": 36, "bat": 4888, "mgiraudofficial": 6023, "twits": 3103, "urge": 4369, "bahaha": 5455, "cheating": 5453, "dee": 5451, "elbow": 5448, "eps": 5447, "prints": 7416, "fourth": 5445, "indy": 5444, "jammin": 5443, "issues": 1428, "statement": 3746, "dumped": 6194, "kc": 5442, "peach": 5440, "officialnjonas": 4910, "piercing": 5439, "diamond": 6000, "puke": 5438, "remake": 8057, "islands": 7954, "9": 800, "ui": 5434, "currently": 1048, "penny": 5947, "gracias": 8850, "dragon": 5428, "heal": 5426, "kiddos": 5422, "nascar": 5420, "change": 527, "girlies": 6127, "paula": 5417, "regardless": 5416, "registered": 5415, "relate": 5414, "canberra": 9774, "nine": 3825, "satisfied": 5412, "stepped": 5409, "teehee": 5406, "itchy": 2984, "wakes": 5405, "ballet": 5404, "haters": 4125, "figures": 5398, "twenty": 5652, "rejected": 5578, "lag": 5393, "nest": 5391, "exhaustion": 9762, "sociology": 8894, "refresh": 5388, "dylan": 5738, "teddy": 5384, "perfection": 8340, "puppy": 1146, "wrapped": 5380, "boyfriends": 5376, "constant": 5375, "dairy": 5372, "2hrs": 6262, "plants": 3442, "ist": 5370, "hub": 7712, "tourney": 7049, "who": 167, "wnt": 6008, "lovers": 5369, "cola": 8715, "transport": 5877, "casey": 6450, "package": 3017, "twitterverse": 2733, "funn": 4526, "portfolio": 5368, "host": 3073, "subscribe": 5715, "unlimited": 5367, "jessemccartney": 6534, "bush": 5362, "celebrities": 6004, "hopeful": 6706, "century": 5361, "debating": 5360, "guns": 5358, "lbs": 5356, "nation": 5354, "nighter": 5352, "joseph": 7428, "yuck": 2486, "led": 6328, "pigs": 5351, "scares": 5346, "yt": 5339, "lung": 8685, "construction": 5337, "determined": 5336, "factor": 5334, "fire": 1167, "spelling": 3348, "hottest": 5333, "practically": 5329, "sides": 5881, "returns": 5326, "pieces": 3095, "sum1": 5322, "adapter": 9541, "wel": 6732, "barcelona": 5318, "celebrations": 9772, "blessing": 5317, "james": 1662, "malaysia": 5473, "condolences": 5316, "css": 5315, "moo": 9070, "donate": 4961, "referring": 5348, "greatly": 5311, "teacher": 1657, "hats": 5310, "joel": 5308, "lastnight": 5307, "peas": 5300, "14th": 6038, "pow": 5299, "semi": 5294, "select": 8973, "hve": 5500, "missouri": 8836, "soy": 5292, "teaser": 7633, "stavros": 5290, "swap": 5289, "tops": 5287, "55": 5285, "boots": 2990, "migraine": 2288, "biking": 5282, "conversation": 2387, "cases": 5281, "electricity": 5277, "aja": 7191, "ily": 1704, "fairy": 5276, "frankiethesats": 5275, "gas": 1978, "gate": 5274, "\u0432": 7142, "quotin": 6270, "casino": 6099, "protest": 8977, "jose": 5272, 