{"format": "graph-model", "generatedBy": "2.4.1", "convertedBy": "TensorFlow.js Converter v3.5.0", "signature": {"inputs": {"embedding_input:0": {"name": "embedding_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/zeros_1/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/split/split_dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/Read/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/Read_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/Read_2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/strided_slice_2/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/strided_slice_2/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/ReverseV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/ReverseV2_1/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/zeros_1/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/split/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/strided_slice_1/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/Read/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/zeros/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/zeros/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/Read_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/Read_2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/zeros_1/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/zeros_1/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/split/split_dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/Read/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/zeros/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/zeros/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/Read_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/Read_2/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/transpose_2/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/ReverseV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/embedding/NotEqual/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/ReverseV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/zeros_1/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/zeros_1/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/split/split_dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/Read/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/zeros/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/Read_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/Read_2/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/transpose_2/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/ReverseV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/strided_slice_2/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/strided_slice_2/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/strided_slice_2/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10000"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential/embedding/embedding_lookup/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "embedding_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/while/enter/_230", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/Read/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsXzEvZm9yd2FyZF9sc3RtXzEvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/while/enter/_231", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/Read_1/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsXzEvZm9yd2FyZF9sc3RtXzEvUGFydGl0aW9uZWRDYWxsL3doaWxl"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/while/enter/_232", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/Read_2/ReadVariableOp"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsXzEvZm9yd2FyZF9sc3RtXzEvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/while/enter/_222", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/time"], "attr": {"T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsXzEvZm9yd2FyZF9sc3RtXzEvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/while/enter/_220", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/while/loop_counter"], "attr": {"parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsXzEvZm9yd2FyZF9sc3RtXzEvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/while/enter/_300", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/Read/ReadVariableOp"], "attr": {"parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsXzEvYmFja3dhcmRfbHN0bV8xL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/while/enter/_301", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/Read_1/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsXzEvYmFja3dhcmRfbHN0bV8xL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/while/enter/_302", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/Read_2/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsXzEvYmFja3dhcmRfbHN0bV8xL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/while/enter/_292", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/time"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsXzEvYmFja3dhcmRfbHN0bV8xL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_80", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/Read/ReadVariableOp"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2ZvcndhcmRfbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_81", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/Read_1/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2ZvcndhcmRfbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_82", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/Read_2/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2ZvcndhcmRfbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_72", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/time"], "attr": {"T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2ZvcndhcmRfbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_70", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/loop_counter"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2ZvcndhcmRfbHN0bS9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/enter/_155", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/Read/ReadVariableOp"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2JhY2t3YXJkX2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/enter/_156", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/Read_1/ReadVariableOp"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2JhY2t3YXJkX2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/enter/_157", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/Read_2/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2JhY2t3YXJkX2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/enter/_147", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/time"], "attr": {"T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2JhY2t3YXJkX2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/enter/_145", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/loop_counter"], "attr": {"T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsL2JhY2t3YXJkX2xzdG0vUGFydGl0aW9uZWRDYWxsL3doaWxl"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/while/enter/_290", "op": "Enter", "input": ["StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/while/loop_counter"], "attr": {"T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbC9iaWRpcmVjdGlvbmFsXzEvYmFja3dhcmRfbHN0bV8xL1BhcnRpdGlvbmVkQ2FsbC93aGlsZQ=="}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential/embedding/NotEqual", "op": "NotEqual", "input": ["embedding_input", "StatefulPartitionedCall/sequential/embedding/NotEqual/y"], "attr": {"incompatible_shape_error": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/embedding/Cast", "op": "Cast", "input": ["embedding_input"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}, "DstT": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/while/merge/_243", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/while/enter/_230", "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/while/next_iteration/_285"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/while/merge/_244", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/while/enter/_231", "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/while/next_iteration/_286"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/while/merge/_245", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/while/enter/_232", "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/while/next_iteration/_287"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/while/merge/_235", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/while/enter/_222", "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/while/next_iteration/_277"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/while/merge/_233", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/while/enter/_220", "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/while/next_iteration/_275"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/while/merge/_313", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/while/enter/_300", "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/while/next_iteration/_355"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/while/merge/_314", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/while/enter/_301", "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/while/next_iteration/_356"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/while/merge/_315", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/while/enter/_302", "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/while/next_iteration/_357"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/while/merge/_305", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/while/enter/_292", "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/while/next_iteration/_347"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/merge/_94", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_80", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/next_iteration/_139"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/merge/_95", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_81", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/next_iteration/_140"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/merge/_96", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_82", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/next_iteration/_141"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/merge/_86", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_72", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/next_iteration/_131"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/merge/_84", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/enter/_70", "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/while/next_iteration/_129"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/merge/_169", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/enter/_155", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/next_iteration/_214"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/merge/_170", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/enter/_156", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/next_iteration/_215"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/merge/_171", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/enter/_157", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/next_iteration/_216"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/merge/_161", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/enter/_147", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/next_iteration/_206"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/merge/_159", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/enter/_145", "StatefulPartitionedCall/sequential/bidirectional/backward_lstm/PartitionedCall/while/next_iteration/_204"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/while/merge/_303", "op": "Merge", "input": ["StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/while/enter/_290", "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/while/next_iteration/_345"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential/embedding/NotEqual", "StatefulPartitionedCall/sequential/bidirectional_1/forward_lstm_1/PartitionedCall/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential/embedding/NotEqual", "StatefulPartitionedCall/sequential/bidirectional_1/backward_lstm_1/PartitionedCall/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/sequential/bidirectional/forward_lstm/PartitionedCall/ExpandDims", "op": "ExpandDims", "input": 