{"format": "graph-model", "generatedBy": "2.4.1", "convertedBy": "TensorFlow.js Converter v3.5.0", "signature": {"inputs": {"embedding_5_input:0": {"name": "embedding_5_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/zeros_1/packed/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/zeros_1/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/split/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/Read/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/zeros/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/Read_1/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/Read_2/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/strided_slice_2/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/strided_slice_2/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/ReverseV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_5/embedding_5/NotEqual/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/transpose_1/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/ReverseV2_1/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/zeros_1/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/zeros_1/Const", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/split/split_dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/strided_slice_1/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/strided_slice_1/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/Read/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/zeros/packed/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/zeros/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/Read_1/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/Read_2/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/strided_slice_2/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/strided_slice_2/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/strided_slice_2/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_5/dense_10/MatMul/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_5/dense_10/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_5/dense_11/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/dense_11/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "unknown", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "20000"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/embedding_5/embedding_lookup/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "embedding_5_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "-1"}]}}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/while/enter/_50", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/Read/ReadVariableOp"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF81L2JpZGlyZWN0aW9uYWxfOC9mb3J3YXJkX2xzdG1fOC9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/while/enter/_51", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/Read_1/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF81L2JpZGlyZWN0aW9uYWxfOC9mb3J3YXJkX2xzdG1fOC9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/while/enter/_52", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/Read_2/ReadVariableOp"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF81L2JpZGlyZWN0aW9uYWxfOC9mb3J3YXJkX2xzdG1fOC9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/while/enter/_42", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/time"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF81L2JpZGlyZWN0aW9uYWxfOC9mb3J3YXJkX2xzdG1fOC9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_INT32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/while/enter/_40", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/while/loop_counter"], "attr": {"T": {"type": "DT_INT32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF81L2JpZGlyZWN0aW9uYWxfOC9mb3J3YXJkX2xzdG1fOC9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/while/enter/_120", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/Read/ReadVariableOp"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF81L2JpZGlyZWN0aW9uYWxfOC9iYWNrd2FyZF9sc3RtXzgvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/while/enter/_121", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/Read_1/ReadVariableOp"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF81L2JpZGlyZWN0aW9uYWxfOC9iYWNrd2FyZF9sc3RtXzgvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/while/enter/_122", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/Read_2/ReadVariableOp"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF81L2JpZGlyZWN0aW9uYWxfOC9iYWNrd2FyZF9sc3RtXzgvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/while/enter/_112", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/time"], "attr": {"T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF81L2JpZGlyZWN0aW9uYWxfOC9iYWNrd2FyZF9sc3RtXzgvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/while/enter/_110", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/while/loop_counter"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF81L2JpZGlyZWN0aW9uYWxfOC9iYWNrd2FyZF9sc3RtXzgvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5/embedding_5/NotEqual", "op": "NotEqual", "input": ["embedding_5_input", "StatefulPartitionedCall/sequential_5/embedding_5/NotEqual/y"], "attr": {"incompatible_shape_error": {"b": true}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/embedding_5/Cast", "op": "Cast", "input": ["embedding_5_input"], "attr": {"DstT": {"type": "DT_INT32"}, "SrcT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/while/merge/_63", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/while/enter/_50", "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/while/next_iteration/_105"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/while/merge/_64", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/while/enter/_51", "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/while/next_iteration/_106"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/while/merge/_65", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/while/enter/_52", "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/while/next_iteration/_107"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/while/merge/_55", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/while/enter/_42", "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/while/next_iteration/_97"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/while/merge/_53", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/while/enter/_40", "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/while/next_iteration/_95"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/while/merge/_133", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/while/enter/_120", "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/while/next_iteration/_175"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/while/merge/_134", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/while/enter/_121", "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/while/next_iteration/_176"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/while/merge/_135", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/while/enter/_122", "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/while/next_iteration/_177"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/while/merge/_125", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/while/enter/_112", "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/while/next_iteration/_167"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/while/merge/_123", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/while/enter/_110", "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/while/next_iteration/_165"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_5/embedding_5/NotEqual", "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/ExpandDims/dim"], "attr": {"T": {"type": "DT_BOOL"}, "Tdim": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/sequential_5/embedding_5/NotEqual", "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/sequential_5/embedding_5/embedding_lookup", "op": "GatherV2", "input": ["unknown", "StatefulPartitionedCall/sequential_5/embedding_5/Cast", "StatefulPartitionedCall/sequential_5/embedding_5/embedding_lookup/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/ExpandDims", "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/transpose_1/perm"], "attr": {"T": {"type": "DT_BOOL"}, "Tperm": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/transpose_1", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/ExpandDims", "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/transpose_1/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_5/embedding_5/embedding_lookup"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential_5/embedding_5/embedding_lookup", "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_5/embedding_5/embedding_lookup"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/transpose", "op": "Transpose", "input": ["StatefulPartitionedCall/sequential_5/embedding_5/embedding_lookup", "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/transpose/perm"], "attr": {"Tperm": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/transpose_1", "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/ReverseV2_1", "op": "ReverseV2", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/transpose_1", "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/ReverseV2_1/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/Shape", "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/strided_slice/stack", "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/strided_slice/stack_1", "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/strided_slice/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/transpose", "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/transpose", "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/strided_slice_1/stack", "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/strided_slice_1/stack_1", "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/strided_slice_1/stack_2"], "attr": {"ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/transpose"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/Shape", "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/strided_slice/stack", "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/strided_slice/stack_1", "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/strided_slice/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "ellipsis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "end_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/ReverseV2", "op": "ReverseV2", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/transpose", "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/ReverseV2/axis"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/strided_slice_1", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/transpose", "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/strided_slice_1/stack", "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/strided_slice_1/stack_1", "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/strided_slice_1/stack_2"], "attr": {"Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "end_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_FLOAT"}, "begin_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/transpose"], "attr": {"out_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/while/enter/_49", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF81L2JpZGlyZWN0aW9uYWxfOC9mb3J3YXJkX2xzdG1fOC9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/ReverseV2_1", "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor/element_shape"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_BOOL"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/strided_slice", "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/zeros_1/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/strided_slice", "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/zeros/packed/1"], "attr": {"N": {"i": "2"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/while/enter/_48", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/TensorArrayUnstack/TensorListFromTensor"], "attr": {"T": {"type": "DT_VARIANT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF81L2JpZGlyZWN0aW9uYWxfOC9mb3J3YXJkX2xzdG1fOC9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/strided_slice_1", "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/Read/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/Shape", "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/strided_slice/stack", "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/strided_slice/stack_2"], "attr": {"end_mask": {"i": "0"}, "shrink_axis_mask": {"i": "1"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/zeros_1/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/strided_slice", "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/zeros_1/packed/1"], "attr": {"axis": {"i": "0"}, "N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/zeros/packed", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/strided_slice", "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/zeros/packed/1"], "attr": {"axis": {"i": "0"}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/TensorArrayUnstack/TensorListFromTensor", "op": "TensorListFromTensor", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/ReverseV2", "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/TensorArrayUnstack/TensorListFromTensor/element_shape"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/MatMul", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/strided_slice_1", "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/Read/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/Shape", "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/strided_slice/stack", "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/strided_slice/stack_1", "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/strided_slice/stack_2"], "attr": {"end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/while/merge/_62", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/while/enter/_49", "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/while/next_iteration/_104"], "attr": {"T": {"type": "DT_VARIANT"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/while/enter/_119", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/TensorArrayUnstack_1/TensorListFromTensor"], "attr": {"is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF81L2JpZGlyZWN0aW9uYWxfOC9iYWNrd2FyZF9sc3RtXzgvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/zeros_1/packed", "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/zeros_1/Const"], "attr": {"index_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/zeros/packed", "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/zeros/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/while/merge/_61", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/while/enter/_48", "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/while/next_iteration/_103"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/strided_slice"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/while/enter/_47", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/strided_slice"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF81L2JpZGlyZWN0aW9uYWxfOC9mb3J3YXJkX2xzdG1fOC9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/zeros_1", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/zeros_1/packed", "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/zeros_1/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "index_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/zeros", "op": "Fill", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/zeros/packed", "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/zeros/Const"], "attr": {"index_type": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/while/enter/_118", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/TensorArrayUnstack/TensorListFromTensor"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF81L2JpZGlyZWN0aW9uYWxfOC9iYWNrd2FyZF9sc3RtXzgvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/TensorArrayV2_1", "op": "TensorListReserve", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/TensorArrayV2_1/element_shape", "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/strided_slice"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/while/enter/_117", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/strided_slice"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF81L2JpZGlyZWN0aW9uYWxfOC9iYWNrd2FyZF9sc3RtXzgvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/while/merge/_132", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/while/enter/_119", "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/while/next_iteration/_174"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/while/enter/_46", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/zeros_1"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF81L2JpZGlyZWN0aW9uYWxfOC9mb3J3YXJkX2xzdG1fOC9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/while/enter/_45", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/zeros"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF81L2JpZGlyZWN0aW9uYWxfOC9mb3J3YXJkX2xzdG1fOC9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/MatMul_1", "op": "MatMul", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/zeros", "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/Read_1/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/while/enter/_43", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/TensorArrayV2_1"], "attr": {"frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF81L2JpZGlyZWN0aW9uYWxfOC9mb3J3YXJkX2xzdG1fOC9QYXJ0aXRpb25lZENhbGwvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_VARIANT"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/while/merge/_60", "op": "Merge", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/while/enter/_47", "StatefulPartitionedCall/sequential_5/bidirectional_8/forward_lstm_8/PartitionedCall/while/next_iteration/_102"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/while/enter/_116", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/zeros_1"], "attr": {"T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "U3RhdGVmdWxQYXJ0aXRpb25lZENhbGwvc2VxdWVudGlhbF81L2JpZGlyZWN0aW9uYWxfOC9iYWNrd2FyZF9sc3RtXzgvUGFydGl0aW9uZWRDYWxsL3doaWxl"}, "is_constant": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/PartitionedCall/while/enter/_115", "op": "Enter", "input": ["StatefulPartitionedCall/sequential_5/bidirectional_8/backward_lstm_8/zeros"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": 